
Процедура КнопкаВыполнитьНажатие(Кнопка)
	отказ = Ложь;
	
	//Форма = Чек.ПолучитьФорму("ФормаРегистрацииПродаж");
	
	ОбработкаДействия(Чек.ПолучитьОбъект(), Отказ);
	Сообщить("Привет!");
КонецПроцедуры

Процедура ПриОткрытии()
	
	// {РТК_1523_19.06.2012 16:32:14_Гордиенко_
	Если Метаданные().Реквизиты.Найти("ВерсияВнешнейОбработки")<>Неопределено И (ЗначениеЗаполнено(ЭтотОбъект.ВерсияВнешнейОбработки)) Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ", версия " + ЭтотОбъект.ВерсияВнешнейОбработки;
	КонецЕсли;
	// РТК_1523_19.06.2012 16:32:14_Гордиенко_}
	
КонецПроцедуры
