
Процедура ПолеКартинки1Нажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВКиберплате.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура РеестрыНажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВКиберплате.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки2Нажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВМТСБ.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура МТСбНажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВМТСБ.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки3Нажатие(Элемент)
	ФормаСписка = Документы.ЗолотаяКоронаВПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ЗолотаяКоронаПерНажатие(Элемент)
	ФормаСписка = Документы.ЗолотаяКоронаВПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
		
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки4Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ЗолотаяКоронаПлатНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки5Нажатие(Элемент)
	ФормаСписка = Документы.ОтменыДПиПК.ПолучитьФормуСписка();
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ОтменыНажатие(Элемент)
	ФормаСписка = Документы.ОтменыДПиПК.ПолучитьФормуСписка();

	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПоказатьЧасы()
   ЭлементыФормы.Надпись1.Заголовок = "Текущее время: " + Формат(ТекущаяДата(),"ДЛФ=T");
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ПоказатьЧасы",1);
КонецПроцедуры


Процедура ПолеКартинки6Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПлатежиНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПолеКартинки7Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПлатежиЗКНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки8Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПереводыНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки9Нажатие(Элемент)
	ФормаСписка = Документы.ЗагруженныеЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ЗагруженныеЛПНажатие(Элемент)
	ФормаСписка = Документы.ЗагруженныеЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки10Нажатие(Элемент)
	ФормаСписка = Документы.ВозвратПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ВозвратыПлатНажатие(Элемент)
	ФормаСписка = Документы.ВозвратПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки11Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыЗКПлатНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки12Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыПерНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки13Нажатие(Элемент)
	ФормаСписка = Документы.Отмены.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыОтменыНажатие(Элемент)
	ФормаСписка = Документы.Отмены.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки14Нажатие(Элемент)
	Отчет = Отчеты.СводныйОтчетПлатежи.Создать();
	Форма = Отчет.ПолучитьФорму("ФормаОтчета");
	Форма.Открыть();
КонецПроцедуры

Процедура СводныйОтчетНажатие(Элемент)
	Отчет = Отчеты.СводныйОтчетПлатежи.Создать();
	Форма = Отчет.ПолучитьФорму("ФормаОтчета");
	Форма.Открыть();
КонецПроцедуры

Процедура ПолеКартинки15Нажатие(Элемент)
	Отчет = Отчеты.ОтчетПоНаличиюЛП.Создать();
	Форма = Отчет.ПолучитьФорму("ОтчетПоНаличиюЛП");
	Форма.Открыть();

КонецПроцедуры

Процедура ОтчетПоЛПНажатие(Элемент)
	Отчет = Отчеты.ОтчетПоНаличиюЛП.Создать();
	Форма = Отчет.ПолучитьФорму("ОтчетПоНаличиюЛП");
	Форма.Открыть();

КонецПроцедуры

Процедура ПолеКартинки16Нажатие(Элемент)
	Отчет = Отчеты.ОтчетПоЗКВПС.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.Открыть();
КонецПроцедуры

Процедура ОтчетЗКРеестрНажатие(Элемент)
	Отчет = Отчеты.ОтчетПоЗКВПС.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.Открыть();
КонецПроцедуры

Процедура ПолеКартинки17Нажатие(Элемент)
	Отчет = Отчеты.ОтчетПоКредитамЗКВПС.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.Открыть();

КонецПроцедуры

Процедура ОтчетПереводыЗКНажатие(Элемент)
	Отчет = Отчеты.ОтчетПоКредитамЗКВПС.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.Открыть();
КонецПроцедуры




