
Процедура ПолеКартинки1Нажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВКиберплате.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура РеестрыНажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВКиберплате.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки2Нажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВМТСБ.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура МТСбНажатие(Элемент)
	ФормаСписка = Документы.ПлатежиВМТСБ.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки3Нажатие(Элемент)
	ФормаСписка = Документы.ЗолотаяКоронаВПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ЗолотаяКоронаПерНажатие(Элемент)
	ФормаСписка = Документы.ЗолотаяКоронаВПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
		
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки4Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ЗолотаяКоронаПлатНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки5Нажатие(Элемент)
	ФормаСписка = Документы.ОтменыДПиПК.ПолучитьФормуСписка();
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ОтменыНажатие(Элемент)
	ФормаСписка = Документы.ОтменыДПиПК.ПолучитьФормуСписка();

	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;

	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПоказатьЧасы()
   ЭлементыФормы.Надпись1.Заголовок = "Текущее время: " + Формат(ТекущаяДата(),"ДЛФ=T");
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ПоказатьЧасы",1);
КонецПроцедуры


Процедура ПолеКартинки6Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПлатежиНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПолеКартинки7Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	//
	//ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	//
	//ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();
КонецПроцедуры


Процедура ПлатежиЗКНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	//
	//ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	//
	//ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки8Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	//ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	//
	//ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	//
	//ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПереводыНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Ложь;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры


Процедура ПолеКартинки9Нажатие(Элемент)
	ФормаСписка = Документы.ЗагруженныеЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ЗагруженныеЛПНажатие(Элемент)
	ФормаСписка = Документы.ЗагруженныеЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки10Нажатие(Элемент)
	ФормаСписка = Документы.ВозвратПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ВозвратыПлатНажатие(Элемент)
	ФормаСписка = Документы.ВозвратПлатежей.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки11Нажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыЗКПлатНажатие(Элемент)
	ФормаСписка = Документы.ПогашенияКредитовЛП.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки12Нажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыПерНажатие(Элемент)
	ФормаСписка = Документы.ПриемПлатежейЗК.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.Использование = Истина;
	ФормаСписка.ДокументСписок.Отбор.Возврат.ВидСравнения  = ВидСравнения.Равно;
	ФормаСписка.ДокументСписок.Отбор.Возврат.Значение  = Истина;
	
	ФормаСписка.ДокументСписок.Отбор.Возврат.установить();
	
	ФормаСписка.ЭлементыФормы.ДокументСписок.НастройкаОтбора.Возврат.Доступность = Ложь;
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки13Нажатие(Элемент)
	ФормаСписка = Документы.Отмены.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВозвратыОтменыНажатие(Элемент)
	ФормаСписка = Документы.Отмены.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	
	
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки14Нажатие(Элемент)
	Отчет = Отчеты.СводныйОтчетПлатежи.Создать();
	Форма = Отчет.ПолучитьФорму("ФормаОтчета");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();
КонецПроцедуры

Процедура СводныйОтчетНажатие(Элемент)
	Отчет = Отчеты.СводныйОтчетПлатежи.Создать();
	Форма = Отчет.ПолучитьФорму("ФормаОтчета");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();
КонецПроцедуры

Процедура ПолеКартинки15Нажатие(Элемент)
	Документы.ПриемПлатежей.ПолучитьФорму("ОтчетПоПлатежамВЛП",,).Открыть();

КонецПроцедуры

Процедура ОтчетПоЛПНажатие(Элемент)
	Документы.ПриемПлатежей.ПолучитьФорму("ОтчетПоПлатежамВЛП",,).Открыть();

КонецПроцедуры

Процедура ПолеКартинки16Нажатие(Элемент)	
	 Документы.ПлатежиВКиберплате.ПолучитьФорму("ОтчетПоПлатежамВКиберплате",,).Открыть();	
КонецПроцедуры

Процедура ОтчетЗКРеестрНажатие(Элемент)	
	 Документы.ПлатежиВКиберплате.ПолучитьФорму("ОтчетПоПлатежамВКиберплате",,).Открыть();	
КонецПроцедуры

Процедура ПолеКартинки17Нажатие(Элемент)
     Документы.ВозвратПлатежей.ПолучитьФорму("ОтчетВозврат",,).Открыть();	
КонецПроцедуры

Процедура ОтчетПереводыЗКНажатие(Элемент)
	 Документы.ВозвратПлатежей.ПолучитьФорму("ОтчетВозврат",,).Открыть();	
КонецПроцедуры

Процедура ПолеКартинки18Нажатие(Элемент)
	Отчет = Отчеты.ОтчетПоОтменам.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();

	
КонецПроцедуры

Процедура ОтчетПлатежиЗКНажатие(Элемент)
	Отчет = Отчеты.ОтчетПоОтменам.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();

КонецПроцедуры

Процедура ПолеКартинки35Нажатие(Элемент)
	
	СписокЗн = Новый СписокЗначений;
	СписокЗн.Добавить("Отчет по переводам (Реестр)");
	СписокЗн.Добавить("Отчет по переводам (ЛП)");
	СписокЗн.Добавить("Отчет по кредитам (Реестр)");
	СписокЗн.Добавить("Отчет по кредитам (ЛП)");
	
	ВыбранныйОтчет = СписокЗн.ВыбратьЭлемент("Выберите нужный отчет");
	
	Если ВыбранныйОтчет = Неопределено тогда		
		Возврат;		
	КонецЕсли;
	
	Если ВыбранныйОтчет = "Отчет по переводам (Реестр)" Тогда		
		Отчет = Отчеты.ОтчетПоЗКВПС.Создать();
		Форма = Отчет.ПолучитьФорму("Отчет");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	ИначеЕсли ВыбранныйОтчет = "Отчет по переводам (ЛП)" Тогда
		Отчет = Отчеты.ОтчетПоПриемуПлатежейЗК.Создать();
		Форма = Отчет.ПолучитьФорму("ОтчетПоПриемуПлатежейЗК");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
		
	ИначеЕсли ВыбранныйОтчет = "Отчет по кредитам (Реестр)" Тогда
		Отчет = Отчеты.ОтчетПоКредитамЗКВПС.Создать();
		Форма = Отчет.ПолучитьФорму("Отчет");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	ИначеЕсли ВыбранныйОтчет = "Отчет по кредитам (ЛП)" Тогда			
		Отчет = Отчеты.ОтчетПоКредитамЗКВЛП.Создать();
		Форма = Отчет.ПолучитьФорму("ОтчетПоПриемуПлатежейЗК");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	КонецЕсли;
	

КонецПроцедуры

Процедура Надпись2Нажатие(Элемент)
	СписокЗн = Новый СписокЗначений;
	СписокЗн.Добавить("Отчет по переводам (Реестр)");
	СписокЗн.Добавить("Отчет по переводам (ЛП)");
	СписокЗн.Добавить("Отчет по кредитам (Реестр)");
	СписокЗн.Добавить("Отчет по кредитам (ЛП)");
	
	ВыбранныйОтчет = СписокЗн.ВыбратьЭлемент("Выберите нужный отчет");
	
	Если ВыбранныйОтчет = Неопределено тогда		
		Возврат;		
	КонецЕсли;
	
	Если ВыбранныйОтчет = "Отчет по переводам (Реестр)" Тогда		
		Отчет = Отчеты.ОтчетПоЗКВПС.Создать();
		Форма = Отчет.ПолучитьФорму("Отчет");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	ИначеЕсли ВыбранныйОтчет = "Отчет по переводам (ЛП)" Тогда
		Отчет = Отчеты.ОтчетПоПриемуПлатежейЗК.Создать();
		Форма = Отчет.ПолучитьФорму("ОтчетПоПриемуПлатежейЗК");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
		
	ИначеЕсли ВыбранныйОтчет = "Отчет по кредитам (Реестр)" Тогда
		Отчет = Отчеты.ОтчетПоКредитамЗКВПС.Создать();
		Форма = Отчет.ПолучитьФорму("Отчет");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	ИначеЕсли ВыбранныйОтчет = "Отчет по кредитам (ЛП)" Тогда			
		Отчет = Отчеты.ОтчетПоКредитамЗКВЛП.Создать();
		Форма = Отчет.ПолучитьФорму("ОтчетПоПриемуПлатежейЗК");
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;		
		Форма.Открыть();
	КонецЕсли;
	

КонецПроцедуры

Процедура ПолеКартинки19Нажатие(Элемент)
	Отчет = Отчеты.НепроведенныеПСдляБухгалтерии.Создать();
	Форма = Отчет.ПолучитьФорму("НепроведенныеПСдляБухгалтерии");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	Форма.Открыть();
КонецПроцедуры

Процедура НепроведенныеНажатие(Элемент)
	Отчет = Отчеты.НепроведенныеПСдляБухгалтерии.Создать();
	Форма = Отчет.ПолучитьФорму("НепроведенныеПСдляБухгалтерии");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	Форма.Открыть();

КонецПроцедуры

Процедура ПолеКартинки20Нажатие(Элемент)
	ФормаСписка = Документы.ДокументыСверки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура СверкиНажатие(Элемент)
	ФормаСписка = Документы.ДокументыСверки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки21Нажатие(Элемент)
	Обработка = Обработки.Перегрузка.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
КонецПроцедуры

Процедура ПовпорнаяЗагрузкаНажатие(Элемент)
	Обработка = Обработки.Перегрузка.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();

КонецПроцедуры

Функция ПолучитьВнешнююОбработку(Ссылка)
	
    Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;	

	Имя = СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()), "-", "");
	
		
	
	ДвоичныеДанные = Ссылка.ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		#Если Клиент тогда
		Сообщить("Не установлена обработка <"+Имя+">!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		об = ВнешниеОбработки.Создать(ИмяФайла, Ложь);	
	Исключение	
		УдалитьФайлы(ИмяФайла);
		Возврат Неопределено;			   
	КонецПопытки;	
	
	
	Возврат об;		
	
	
	
КонецФункции	


Процедура ПолеКартинки22Нажатие(Элемент)
	
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Загрузка киберплат из SQL",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();
	
	
КонецПроцедуры

Процедура ПовторноРеестрКиберНажатие(Элемент)
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Загрузка киберплат из SQL",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();

КонецПроцедуры

Процедура ПолеКартинки23Нажатие(Элемент)
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Загрузка мтс-б из SQL",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();

КонецПроцедуры

Процедура ПовторноРеестрМТСНажатие(Элемент)
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Загрузка мтс-б из SQL",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();
КонецПроцедуры

Процедура ПолеКартинки24Нажатие(Элемент)
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Получить ПосЛог",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();
КонецПроцедуры

Процедура ПолучитьПосЛогНажатие(Элемент)
	обработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Получить ПосЛог",Истина);
	обработкаОбъект = ПолучитьВнешнююОбработку(ОбработкаСсылка);
	ФормаО = ОбработкаОбъект.получитьФорму("форма");
	ФормаО.Открыть();
КонецПроцедуры

Процедура ПолеКартинки25Нажатие(Элемент)
	Обработка = Обработки.ПроведениеДокументов.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
	
	
КонецПроцедуры

Процедура ПроставитьШлюзыНажатие(Элемент)
	Обработка = Обработки.ПроведениеДокументов.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();

	
КонецПроцедуры

Процедура ПолеКартинки26Нажатие(Элемент)
	Обработка = Обработки.СверкаДПиПК.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();

КонецПроцедуры

Процедура УстановУслугиНажатие(Элемент)
	Обработка = Обработки.СверкаДПиПК.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
	
	
	
КонецПроцедуры

Процедура ПолеКартинки27Нажатие(Элемент)
	Обработка = Обработки.РабочееМестоСпециалиста.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
КонецПроцедуры

Процедура ПровестиДокументыНажатие(Элемент)
	Обработка = Обработки.РабочееМестоСпециалиста.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
КонецПроцедуры

Процедура ПолеКартинки28Нажатие(Элемент)
	ФормаСписка = Справочники.ТорговыеТочки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ТорговыеТочкиНажатие(Элемент)
	ФормаСписка = Справочники.ТорговыеТочки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки29Нажатие(Элемент)
	ФормаСписка = Справочники.Номенклатура.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура НоменклатураНажатие(Элемент)
	ФормаСписка = Справочники.Номенклатура.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки30Нажатие(Элемент)
	ФормаСписка = Справочники.Шлюзы.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ШлюзыНажатие(Элемент)
	ФормаСписка = Справочники.Шлюзы.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки31Нажатие(Элемент)
	ФормаСписка = Справочники.Провайдеры.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПровайдерыНажатие(Элемент)
	ФормаСписка = Справочники.Провайдеры.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки32Нажатие(Элемент)
	ФормаСписка = Справочники.Операторы.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ОператорыНажатие(Элемент)
	ФормаСписка = Справочники.Операторы.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки33Нажатие(Элемент)
	ФормаСписка = Справочники.ПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПСНажатие(Элемент)
	ФормаСписка = Справочники.ПС.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПолеКартинки34Нажатие(Элемент)
	ФормаСписка = Справочники.ВнешниеОбработки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ВнешниеОбработкиНажатие(Элемент)
	ФормаСписка = Справочники.ВнешниеОбработки.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура НоваяЗаявкаНажатие(Элемент)
	ФормаНов = Документы.ЗаявкиНаОтмену.ПолучитьФормуНовогоДокумента();
	ФормаНов.Открыть();
КонецПроцедуры

Процедура ПолеКартинки36Нажатие(Элемент)
	ФормаНов = Документы.ЗаявкиНаОтмену.ПолучитьФормуНовогоДокумента();
	ФормаНов.Открыть();	
КонецПроцедуры

Процедура ПолеКартинки37Нажатие(Элемент)
	ФормаСписка = Документы.ЗаявкиНаОтмену.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ЗаявкиНаОтменуНажатие(Элемент)
	ФормаСписка = Документы.ЗаявкиНаОтмену.ПолучитьФормуСписка();
	формаСписка.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	ФормаСписка.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;


	//ФормаСписка.ДокументСписок.Отбор.Дата.Использование = Истина;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ВидСравнения  = ВидСравнения.ИнтервалВключаяГраницы;
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеС  = НачалоМесяца(ТекущаяДата());
	//ФормаСписка.ДокументСписок.Отбор.Дата.ЗначениеПо = ТекущаяДата();
	//ФормаСписка.ДокументСписок.Отбор.Дата.установить();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПолеКартинки38Нажатие(Элемент)
	Обработка = Обработки.ПроставлениеОтмен.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();
КонецПроцедуры

Процедура ПроставлениеОтменНажатие(Элемент)
	Обработка = Обработки.ПроставлениеОтмен.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();

КонецПроцедуры

Процедура ПолеКартинки39Нажатие(Элемент)
	Отчет = Отчеты.ОтчетПоОтменам.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();
КонецПроцедуры

Процедура ОтмененныеПлатежиНажатие(Элемент)
	Отчет = Отчеты.ОтчетПоОтменам.Создать();
	Форма = Отчет.ПолучитьФорму("Отчет");
	Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;

	Форма.Открыть();

КонецПроцедуры

Процедура ПриОткрытии()
	
	Если НЕ РольДоступна("Корректировка") Тогда		
		ЭлементыФормы.РамкаГруппы2.Видимость = Ложь;
		ЭлементыФормы.ПолеКартинки36.Видимость = Ложь;
		ЭлементыФормы.ПолеКартинки37.Видимость = Ложь;
		ЭлементыФормы.ПолеКартинки38.Видимость = Ложь;
		ЭлементыФормы.ПолеКартинки39.Видимость = Ложь;
		ЭлементыФормы.НоваяЗаявка.Видимость = Ложь;
		ЭлементыФормы.ЗаявкиНаОтмену.Видимость = Ложь;
		ЭлементыФормы.ПроставлениеОтмен.Видимость = Ложь;
		ЭлементыФормы.ОтмененныеПлатежи.Видимость = Ложь;
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура Надпись3Нажатие(Элемент)
	Обработка = Обработки.НедельнаяСверка.Создать();
	ФормаОбработки = Обработка.ПолучитьФорму("Форма");
	ФормаОбработки.Открыть();

КонецПроцедуры




