
	

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Таблица = ДанныеИЗSQL_Киберплат(ДатаС, ДатаПо);
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		
		Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлатежиВМТСБ.Ссылка,
			|   ПлатежиВМТСБ.ID
			|ИЗ
			|	Документ.ПлатежиВКиберплате КАК ПлатежиВМТСБ
			|ГДЕ
			|	ПлатежиВМТСБ.Дата МЕЖДУ &Дата1 И &Дата2";
			Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаС-60*60*24));
			Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаПо));
			//Запрос.УстановитьПараметр("Транзакция", Строка.НомерТранзакции);
			Рез = Запрос.Выполнить().Выгрузить();

		
		
		
		Попытка
			Для каждого СтрокаТаблицы ИЗ Таблица Цикл
				НайденныйДокумент = Рез.Найти(СтрокаТаблицы.Комментарий);
				Если НайденныйДокумент <> Неопределено тогда						
					продолжить;
				КонецЕсли;
				СохранитьПлатежиВДокументы_Киберплат(СтрокаТаблицы);
			КонецЦикла;
		Исключение
		КонецПопытки;		
	КонецЕсли;
	
	
	
КонецПроцедуры
