 перем ВернутьРезультат;

Процедура ПриЗакрытии()
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);

КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ПолучитьСерверТО().ОбработатьВнешнееСобытие(Источник, Событие, Данные, ЭтаФорма);

КонецПроцедуры

Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПоддерживаетсяВидТО
Процедура СШКОбработатьШтрихкод(Штрихкод) Экспорт
	
	ШК = ШтрихКод;
	
	
КонецПроцедуры


Процедура ОКНажатие(Элемент)
	Если ЗначениеЗаполнено(ШК) тогда
		ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);

		Закрыть(ШК);
	Иначе
		Предупреждение("Внимание! Считайте или введите ШК аксессуара");
		Возврат;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПриОткрытии()
    
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
КонецПроцедуры
