Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Форма = ПолучитьФорму("ФормаНапоминания");
	
	Если ЕстьАртикул > 0 Тогда
		Форма.ЭлементыФормы.Панель1.ТекущаяСтраница = Форма.ЭлементыФормы.Панель1.Страницы[ЕстьАртикул-1];
	КонецЕсли;
    Форма.Акция = Акция;
	Форма.СмежнаяАкция = СмежнаяАкция;
	Результат = Форма.ОткрытьМодально();
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		//закрыто окно без нажатия кнопки
		КодЗакрытия = "0";
	ИначеЕсли Результат = Ложь Тогда
		КодЗакрытия = "0";
	ИначеЕсли Результат = Истина Тогда		
		КодЗакрытия = "1";               		
	КонецЕсли;	
	
	
	Отказ=Ложь;
	
КонецПроцедуры

