Процедура Кнопка1Нажатие(Элемент)
//	НомерТелефона = НомерТелефонаЦифрами(НомерТелефонаМТС);
Отказать = Ложь;
Если ЗначениеЗаполнено(НомерТелефонаМТС)  Тогда
	НомерТелефонаМТС = НомерТелефонаЦифрами(НомерТелефонаМТС);
	// Проверка на дублированность номера в акции
	Если НомерТелефонаУжеУчаствуетВАкции(НомерТелефонаМТС) Тогда
		Если Не Отказать Тогда
			Предупреждение("Данный номер телефона уже участвует в акции " + ЭтотОбъект.Акция + "
			|Вы можете указать другой номер, либо отказаться от участия в акции", 10);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Учёт технических проблем связи с хранилищем
	Если Отказать Тогда
		НомерТелефонаМТС = "";
	КонецЕсли;
	
	// Выход с возвратом корректного номера телефона
	Закрыть(НомерТелефонаМТС);
	Возврат;
КонецЕсли;

// Информационное сообщение об ошибке
Если СтрДлина(НомерТелефонаМТС) <> 10 Тогда
	Чек.ВывестиИнформациюОбОшибке("Номер телефона должен быть десятизначным (исключая +7)");
КонецЕсли;

КонецПроцедуры
Функция НомерТелефонаЦифрами(НомерТелефона)
	Возврат   Прав(стрЗаменить(стрЗаменить(стрЗаменить(НомерТелефона,"(",""),")",""),"-",""),10);
КонецФункции

// Проверка на принадлежность к номерам, участвующим в акции
Функция ЭтоНомерМТС(НомерТелефона)  
	Код = Лев(НомерТелефона, 3);
	Возврат (Код = "911" Или Код = "981" ИЛИ Код = "910" ИЛИ Код = "980" ИЛИ Код = "919" ИЛИ Код = "913" ИЛИ Код = "912" ИЛИ Код = "914" ИЛИ Код = "915" ИЛИ Код = "916" ИЛИ Код = "917" ИЛИ Код = "918" ИЛИ Код = "982" ИЛИ Код = "983" ИЛИ Код = "984" ИЛИ Код = "985" ИЛИ Код = "987" ИЛИ Код = "988" ИЛИ Код = "989") И СтрДлина(НомерТелефона) = 10;
КонецФункции
	
// Проверка, либо регистрация номера телефона на участие в акции
Функция ПроверитьЗаписатьНомерТелефонаНаУчастиеВАкции(НомерТелефона, ВидОперации)
	CyberPlat = ПолучитьСерверТО().ПолучитьВнешнююОбработку(Справочники.ВнешниеОбработки.CyberPlat);
	Если CyberPlat = Неопределено  Тогда
		ОписаниеОшибки = ("При выполнении действий по участию в акции произошла ошибка.
		|Не удалось получить обработку <CyberPlat>!
		|");
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
		Возврат Истина;
	КонецЕсли;
	
	// Каталог для сохранения запроса
	ИмяКаталога = Константы.КаталогВыгрузкиДанных.Получить();
	ИмяКаталога = ?(Не ЗначениеЗаполнено(ИмяКаталога), "C:\jeeves\OUT", ИмяКаталога);
	ИмяКаталога = ?(Прав(ИмяКаталога, 1) = "\", Лев(ИмяКаталога, СтрДлина(ИмяКаталога) -1), ИмяКаталога) + "\OUT";
	СоздатьКаталог(ИмяКаталога);
	
	// Файл для сохранения запроса
	КодТочки = ВРег(СокрЛП(ПараметрыСеанса.ТекущийМагазин.Код));
	ИмяФайла = КодТочки + "ACTION_MEMBERSHIP.xml";
	ПолноеИмяФайла = ИмяКаталога + "\" + ИмяФайла;
		
	// Создание XML-запроса
	ЗаписьXML = Новый ЗаписьXML;    
	ЗаписьXml.ОткрытьФайл(ПолноеИмяФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("MARKETING.ACTION_MEMBERSHIP");  
	
	Если Константы.ТестоваяБаза.Получить() = Истина Тогда
		
		url =  "http://checkpointservice.tsretail.ru/CheckPointWebService.asmx/ProcessXml";
		
	Иначе
		
		// Адрес боевого сервиса.
		
		
		url =   "http://checkpointservice.tsretail.ru/CheckPointWebService.asmx/ProcessXml";
	КонецЕсли;
	
	// ЗаписьXML.ЗаписатьАтрибут("xmlns", url);
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("request");
	
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "process_name",	"DISCOUNT");
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "function",	"ACTION_CHECK");
	ЗаписьXML.ЗаписатьНачалоЭлемента("function_params");
	//CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "SaleDate",	ТекущаяДата());
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "subsite_code",	ПараметрыСеанса.КодТочки);
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "actioncode", ТекстСлужебный);
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "phonenumber",	НомерТелефона);
	CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "operator_code", СокрЛП(Чек.Продавец.ТабельныйНомер));
	//CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "Article", НоменклатураАрт);
	
	//CyberPlat.ЗаписатьЭлементXML(ЗаписьXML, "Description",	"проверка");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	
	
	//ЗаписьXML.ЗаписатьКонецЭлемента(); // Request
	ЗаписьXML.ЗаписатьКонецЭлемента(); // CheckForAction
	ЗаписьXML.Закрыть();
	
	// Подготовка строки ответа
	AnswerXML = "";
	РасширенныйКодОшибки = -1;
	
	// Отправка запроса
	XML = Новый ТекстовыйДокумент;
	XML.Прочитать(ИмяКаталога + "\" + ИмяФайла);
	
	Рез = CyberPlat.глОтправитьПоHTTP(XML.ПолучитьТекст(), AnswerXML, , РасширенныйКодОшибки, , , , url, , 1, , , Истина);
	
	
	
	
	
	// Подготовка дерева ответа
	ДеревоXML = "";
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXml.УстановитьСтроку(AnswerXML);
	
	// Построение дерева из ответа
	Если Не CyberPlat.ПостроитьДеревоXML(ЧтениеXml, ДеревоXML) Тогда
		ТекстВопроса = "Из-за технических проблем невозможно зарегистрировать клиента в данной акции.
		|Желаете продолжить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		Отказать = Истина;
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	//Сообщить(НоменклатураАрт);
	// Разбор ответа
	ЕстьТакойНомер = Ложь;
	Попытка
		Если	(ДеревоXML.response.is_error = "1")  тогда
			
			ЕстьТакойНомер = Истина;
		ИначеЕсли ДеревоXML.response.is_error = "0"  И ДеревоXML.response.message.count = "0" тогда
			ЕстьТакойНомер = Ложь;
		ИначеЕсли ДеревоXML.response.is_error = "0"  И ДеревоXML.response.message.count = "1" тогда	
			ЕстьТакойНомер = Истина;
			
			
		КонецЕсли;	
		
		Возврат ЕстьТакойНомер;
	Исключение
		Возврат Истина;
	КонецПопытки;
	

КонецФункции

Функция НомерТелефонаУжеУчаствуетВАкции(НомерТелефона)

	Возврат ПроверитьЗаписатьНомерТелефонаНаУчастиеВАкции(НомерТелефона, "check_action");
	
КонецФункции


Процедура ПриОткрытии()
	НомерТелефонаМТС = "";
	
	
КонецПроцедуры

